var trend_data=[
    {
    "交易日期": "108.12.04",
    "作物名稱": "椰子",
    "市場名稱": "台北二",
    "平均價": 10.8
    },
    {
    "交易日期": "108.12.05",
    "作物名稱": "椰子",
    "市場名稱": "台北二",
    "平均價": 15
    },
    {
    "交易日期": "108.12.06",
    "作物名稱": "椰子",
    "市場名稱": "台北二",
    "平均價": 18
    },
    {
    "交易日期": "108.12.07",
    "作物名稱": "椰子",
    "市場名稱": "台北二",
    "平均價": 17.1
    },
    {
    "交易日期": "108.12.08",
    "作物名稱": "椰子",
    "市場名稱": "台北二",
    "平均價": 13
    },
    {
    "交易日期": "108.12.09",
    "作物名稱": "椰子",
    "市場名稱": "台北二",
    "平均價": 15
    },
    {
    "交易日期": "108.12.10",
    "作物名稱": "椰子",
    "市場名稱": "台北二",
    "平均價": 16
    },

    {
    "交易日期": "108.12.04",
    "作物名稱": "蘋果",
    "市場名稱": "台北一",
    "平均價": 10.8
    },
    {
    "交易日期": "108.12.05",
    "作物名稱": "蘋果",
    "市場名稱": "台北一",
    "平均價": 15
    },
    {
    "交易日期": "108.12.06",
    "作物名稱": "蘋果",
    "市場名稱": "台北一",
    "平均價": 18
    },
    {
    "交易日期": "108.12.07",
    "作物名稱": "蘋果",
    "市場名稱": "台北一",
    "平均價": 17.1
    },
    {
    "交易日期": "108.12.08",
    "作物名稱": "蘋果",
    "市場名稱": "台北一",
    "平均價": 13
    },
    {
    "交易日期": "108.12.09",
    "作物名稱": "蘋果",
    "市場名稱": "台北一",
    "平均價": 15
    },
    {
    "交易日期": "108.12.10",
    "作物名稱": "蘋果",
    "市場名稱": "台北一",
    "平均價": 16
    },

    {
    "交易日期": "108.12.04",
    "作物名稱": "椰子",
    "市場名稱": "台北一",
    "平均價": 10.8
    },
    {
    "交易日期": "108.12.05",
    "作物名稱": "椰子",
    "市場名稱": "台北一",
    "平均價": 15
    },
    {
    "交易日期": "108.12.06",
    "作物名稱": "椰子",
    "市場名稱": "台北一",
    "平均價": 18
    },
    {
    "交易日期": "108.12.07",
    "作物名稱": "椰子",
    "市場名稱": "台北一",
    "平均價": 17.1
    },
    {
    "交易日期": "108.12.08",
    "作物名稱": "椰子",
    "市場名稱": "台北一",
    "平均價": 13
    },
    {
    "交易日期": "108.12.09",
    "作物名稱": "椰子",
    "市場名稱": "台北一",
    "平均價": 15
    },
    {
    "交易日期": "108.12.10",
    "作物名稱": "椰子",
    "市場名稱": "台北一",
    "平均價": 16
    }



]